/*
# 表名
dim_ad_slot

# 备注
来源：https://mini1.feishu.cn/sheets/shtcnDA3AIyw80TtGESoGMUKIvb?sheet=maa2E4

# 结果字段（字段名-类型-comment）
ad_slot_id     int     广告位ID
ad_slot_type   varchar 广告位类型，冒险/平台/开发者
ad_slot_name   varchar 广告位名称
is_on          int     是否启用，0/1
update_dt      varchar 数据更新日期

*/

with
args as (select '2026-03-02' as update_dt)
select ad_slot_id,ad_slot_type,ad_slot_name,is_on
,(select update_dt from args) as update_dt
from (values
 (2,'冒险','看广告免费原地复活（冒险）',1)
,(5,'平台','看广告立刻减少果实开启时间',1)
,(9,'平台','福利，广告商的赞助',1)
,(10,'平台','礼包-活动界面',1)
,(17,'冒险','复活-原生',1)
,(18,'平台','预留原生位置',1)
,(19,'平台','家园果实-原生',1)
,(20,'平台','H5活动页',1)
,(25,'冒险','冒险模式广告奖励',0)
,(26,'平台','迷你点商城',1)
,(27,'平台','福利广告商的赞助2',1)
,(28,'平台','广告礼包',1)
,(29,'平台','悦享卡广告',0)
,(32,'平台','幸运方块-观看广告免费闯关',1)
,(33,'平台','幸运方块-观看广告闯关复活',1)
,(34,'平台','游戏内活动临时广告位',1)
,(35,'平台','家园图鉴预留',1)
,(37,'平台','H5-外部合作分成',1)
,(38,'平台','礼物广告',1)
,(39,'平台','AVT看广告直接获得',1)
,(40,'平台','福利2-再次观看',0)
,(50,'平台','迷斯拉搞怪商店',1)
,(51,'平台','悦享卡配套任务专用',1)
,(52,'平台','福利抽奖',1)
,(53,'平台','特惠礼包广告',1)
,(60,'平台','自动重生-原生',1)
,(61,'平台','结算页面-原生',1)
,(101,'开发者','开发者商店',1)
,(102,'开发者','开发者触发器',1)
,(104,'开发者','资源工坊广告获取',1)
,(105,'开发者','开发者复活',1)
,(106,'开发者','开发者插屏',1)
,(109,'开发者','开发者npc',1)
,(110,'开发者','开发者福利tab',1)
,(111,'开发者','studio开发者广告',1)
,(112,'开发者','模组广告购买',1)
,(3,'冒险','广告商人，刷新物品',0)
,(4,'冒险','广告商人，兑换物品',0)
,(6,'平台','进入房间不成功的时候',0)
,(7,'平台','观看广告代替一次分享',0)
,(8,'平台','被踢出房间鼓励奖',0)
,(11,'平台','礼包-福利界面',0)
,(12,'平台','迷你工坊下载等待',0)
,(13,'平台','进入地图插屏广告',0)
,(15,'平台','福利界面原生',0)
,(14,'平台','迷你点商城-图片插屏',0)
,(16,'平台','迷你点商城-插屏视频',0)
,(21,'平台','开始游戏广告按钮',0)
,(22,'平台','开始游戏广告弹窗',0)
,(23,'平台','联机大厅广告弹窗',0)
,(24,'平台','迷你工坊广告弹窗',0)
,(30,'冒险','广告商人2兑换物品',0)
,(31,'冒险','广告商人2刷新物品',0)
,(36,'平台','累计收益',0)
,(103,'开发者','开发者通行证',0)
,(107,'开发者','开发者H5',0)
,(108,'开发者','开发者触发器插屏-图片',0)
,(41,'平台','福利1-再次观看',0)
,(42,'平台','迷你点-商城再次观看',0)
,(43,'平台','迷你点-商城购买弹窗',0)
,(44,'平台','装扮首页-迷你点不足弹窗',0)
,(45,'平台','装扮详情-迷你点不足弹窗',0)
,(46,'平台','迷你点-抽奖转盘右侧按钮',0)
,(47,'平台','迷你点-抽奖转盘',0)
,(48,'平台','迷你点-精选公告',0)
,(49,'平台','累计收益找回',0)
,(54,'冒险','蓝图-自动搭建',1)
,(55,'冒险','游商NPC：看广告刷新货架',1)
,(56,'冒险','游商NPC：看广告兑换商品',1)
) as t(ad_slot_id,ad_slot_type,ad_slot_name,is_on)
order by is_on desc,ad_slot_id
;
